<template>
  <div style="overflow-x: auto; " class="grid grid-cols-16 w-full h-[400px] ">
    <div style="position: absolute; bottom: -30px; box-shadow: 0px -5px 5px #888;" class="w-[650px] ml-[-32px] h-[60px]  bg-white">
      <m-btn class="grow w-[200px] ml-[400px] mt-[16px]">
        Сохранить
      </m-btn>
    </div>
     <button v-for="item in icons" @click="addIcon(item)" class="fa-solid font-awesome m-[10px] text-[#374957] text-[18px] font-[400]">
       <span v-html="item"></span>
     </button>
  </div>
</template>

<script setup>
const icons = ref([
      '&#xf062','&#xf003','&#xf004','&#xf005','&#xf006','&#xf007','&#xf008','&#xf009','&#xf010','&#xf011','&#xf012','&#xf013',
  '&#xf014','&#xf015','&#xf016','&#xf017','&#xf018','&#xf019','&#xf020','&#xf021','&#xf022','&#xf023','&#xf024','&#xf025','&#xf026',
  '&#xf027','&#xf028','&#xf029','&#xf030','&#xf031','&#xf032','&#xf033','&#xf034','&#xf035','&#xf036','&#xf037','&#xf038','&#xf039',
  '&#xf040','&#xf041','&#xf042','&#xf043','&#xf044','&#xf045','&#xf046','&#xf047','&#xf048','&#xf049','&#xf050','&#xf051','&#xf052',
  '&#xf053','&#xf054','&#xf055','&#xf056','&#xf057','&#xf058','&#xf059','&#xf060','&#xf061','&#xf062','&#xf063','&#xf064','&#xf065',
  '&#xf066','&#xf067','&#xf068','&#xf069','&#xf070','&#xf071','&#xf072','&#xf073','&#xf074','&#xf075','&#xf076','&#xf077','&#xf078',
  '&#xf079','&#xf080','&#xf081','&#xf082','&#xf083','&#xf084','&#xf085','&#xf086','&#xf087','&#xf088','&#xf089','&#xf090','&#xf091',
  '&#xf092','&#xf093','&#xf094','&#xf095','&#xf096','&#xf097','&#xf098','&#xf099','&#xf082','&#xf001','&#xf002','&#xf003','&#xf004',
  '&#xf005','&#xf006','&#xf007','&#xf008','&#xf009','&#xf010','&#xf011','&#xf012','&#xf013','&#xf014','&#xf015','&#xf016','&#xf017',
  '&#xf018','&#xf019','&#xf020','&#xf021','&#xf022','&#xf023','&#xf024','&#xf025','&#xf026','&#xf027','&#xf028','&#xf029','&#xf030',
  '&#xf031','&#xf032','&#xf033','&#xf034','&#xf035','&#xf036','&#xf037','&#xf038','&#xf039','&#xf040','&#xf041','&#xf042','&#xf043',
  '&#xf044','&#xf045','&#xf046','&#xf047','&#xf048','&#xf049','&#xf050','&#xf051','&#xf052','&#xf053','&#xf054','&#xf055','&#xf056',
  '&#xf057','&#xf058','&#xf059','&#xf060','&#xf061','&#xf062','&#xf063','&#xf064','&#xf065','&#xf066','&#xf067','&#xf068','&#xf069',
  '&#xf070','&#xf071','&#xf082','&#xf072','&#xf073','&#xf074','&#xf075','&#xf076','&#xf077','&#xf078','&#xf079','&#xf080','&#xf081',
  '&#xf082','&#xf083','&#xf084','&#xf085','&#xf086','&#xf087','&#xf088','&#xf089','&#xf090','&#xf091','&#xf092','&#xf093','&#xf094',
  '&#xf095','&#xf096','&#xf097','&#xf098','&#xf099','&#xf246','&#xf201','&#xf202',
])
const emit = defineEmits([
    'addIcon'
])
const addIcon = (item) =>{
  emit('addIcon', item)
}
</script>

<style scoped>

</style>
